# Используйте официальный образ Node.js
FROM node:18

# Установите рабочий каталог внутри контейнера
WORKDIR /

# Копируйте файлы приложения в контейнер в /app
COPY . /

# Перейдите в каталог backend (предполагается, что ваш бэкенд находится в папке backend)
WORKDIR /services

# Установите зависимости для бэкенда
RUN npm install

# Вернитесь в основной каталог приложения
WORKDIR /

# Перейдите в каталог frontend (предполагается, что ваш фронтенд находится в папке frontend)
WORKDIR /client
WORKDIR /config
WORKDIR /models
WORKDIR /routes


# Установите зависимости для фронтенда
RUN npm install

# Вернитесь в основной каталог приложения
WORKDIR /

# Экспортируйте порт, который ваше приложение будет использовать (фронтенд)
EXPOSE 5000

# Запустите приложение при старте контейнера (предполагается, что у вас есть скрипт запуска для бэкенда и фронтенда)
CMD ["npm", "run", "start"]
